Duplicate Method (SheetDuplicateOption)
 Duplicates this sheet to generate a new one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId Duplicate(
	SheetDuplicateOption duplicateOption
)
Visual Basic
Public Function Duplicate ( _
	duplicateOption As SheetDuplicateOption _
) As ElementId
Visual C++
public:
ElementId^ Duplicate(
	SheetDuplicateOption duplicateOption
)
Parameters
duplicateOption
Type: Autodesk.Revit.DBSheetDuplicateOption
 The option to use when duplicating the sheet.
Return Value
 The id of the newly created sheet.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.ExceptionsInvalidOperationException |  Sheet cannot be duplicated
See Also
ViewSheet Class
Duplicate Overload
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →